import React, {Component} from "react"
import Book_one from "./SonAssembly/Book_one";
import '../CSS/Book.css';

//导入绘本馆图书资源
let name = ["我的成长书滑轮", "我的成长书我不挑食", "我的成长书没水了", "我的成长书垃圾放哪里", "我的成长书对不起", "我的成长书家里的安全", "我的成长书不关我的事", "我的成长书停电了", "我的成长书斜面", "我的成长书车轮与齿轮", "我的成长书小蝌蚪", "我的成长书毛毛虫", "我的成长书小雨滴", "我的成长书我爱运动", "我的成长书路上的安全", "我的成长书听觉的秘密", "我的成长书嗅觉的秘密", "我的成长书户外的安全", "我的成长书别伤害自然", "我的成长书味觉的秘密", "我的成长书触觉的秘密", "我的成长书我会刷牙", "我的成长书我不乱动药", "我的成长书杠杆", "我的成长书倾听的美丽", "我的成长书助人的真谛", "我的成长书视觉的秘密", "我的成长书水边的安全", "我的成长书不是我做的", "我的成长书吃饭的学问", "爸爸，我害怕了怎么办？", "陪爸爸上夜班", "爸爸的池塘", "我爸爸超厉害", "爸爸", "没关系 没关系", "我……有梦", "你们都是我的最爱", "美丽女孩儿", "最喜欢妈妈", "妈妈，你会永远爱我吗？", "妈妈你好吗？", "超能陆战队终极电影故事 全真剧照版", "小阿力的大学校", "欧先生的大提琴", "我不敢说，我怕被骂", "创造力训练", "我的大喊大叫的一天!", "绿豆姑娘", "冰雪哈尔滨", "七彩下雨天", "能找到几只小猪", "给孩子的古诗", "到底应该怎么归类", "数泡泡", "给孩子的古诗", "快看看几点了", "猪小弟，你太重了", "不会飞的小鼯鼠-如何面对失败", "不开心的黑绵羊-如何面对自卑", "最好的朋友-如何面对分歧和争议", "快乐的小蜣螂-如何面对排斥和孤立", "我要演大灰狼-如何面对拒绝", "爬上瓜秧的蜗牛", "我的野生动物朋友 正版我和动物人与自然文库儿童动物世界百科知识 大自然奇趣成长图画书动物书籍6-12-15岁", "雪熊", "动物园大骚动", "贝贝熊系列去医院", "妈妈，我从哪里来", "迪士尼拼音认读故事—超能陆战队", "自己的颜色", "我的头脑最强大", "学前500字", "冰雪奇缘", "迪士尼流利阅读第1级 超能陆战队", "迪士尼流利阅读第2级 疯狂动物城", "小鹿斑比", "冰雪奇缘", "小公主索菲亚", "小公主索菲亚", "寻梦环游记", "贝贝熊系列实话实说", "贝贝熊系列小霸王", "365夜故事", "曹冲称象", "小熊和最好的爸爸：聚会", "蝴蝶仙子和精灵公主", "世界上最好的爸爸", "亮丽精美触摸书-小兔比利", "亮丽精美触摸书-小熊波比", "我长大了", "亮丽精美触摸书-小猫头鹰奥奇", "小熊和最好的爸爸：搬家", "亮丽精美触摸书-小水獭奥斯卡", "小熊和最好的爸爸：当厨师", "做游戏", "看世界", "大闹天宫 3：齐天大圣", "英语阅读丽声经典故事屋", "大闹天宫 2：初上天庭", "大闹天宫 5：大闹天宫", "大闹天宫 4：蟠桃盛会", "十万个为什么奇妙的科学", "怕黑", "逃家小兔", "赛车英雄", "疯狂动物城 奇思妙想 涂色书", "疯狂动物城 奇思妙想 涂色书", "迪士尼拼音认读故事—迪士尼经典", "最好的朋友", "了不起的愿望", "怪兽大学", "街上流行黄裙子", "闪电麦坤", "救护车的故事", "迪士尼故事爱的真谛", "迪士尼故事智慧的力量", "Five little monkeys", "迪士尼拼音认读故事赛车总动员", "国际大奖小说:一只眼睛的猫", "我想去看海", "我想有颗星星·不一样的卡梅拉2", "我去找回太阳", "儿歌", "手指谣", "最好的魔法迪士尼拼音故事",
 "神笔马良", "神笔马良2", "豌豆上的公主", "成语故事绘本", "水中捞月", "郑人买履", "铁杵磨成针", "成语故事绘本掩耳盗铃", "成语故事绘本守株待兔", "成语故事绘本狐假虎威", "滥竽充数", "成语故事绘本画龙点睛", "成语故事绘本南辕北辙", "揠苗助长", "成语故事绘本亡羊补牢", "盲人摸象", "成语故事绘本胸有成竹", "自相矛盾", "成语故事绘本杞人忧天", "井底之蛙", "成语故事绘本黔驴技穷", "叶公好龙", "最棒的团队 拯救鲸鱼大行动", "声律启蒙", "咿咿呀呀讲童话：语言篇", "英雄葫芦娃", "视觉大发现", "视觉大发现2", "视觉大发现", "视觉大发现4", "木头人的医生", "A32", "打招呼", "去买玩具啦", "我喜欢刷牙", "全都收拾好", "我来帮忙", "起床了，穿衣服", "不要妈妈抱", "大家一起玩", "彼得兔全集：大胡子塞缪尔", "彼得兔全集：小松鼠纳特金", "彼得兔全集：大胡子塞缪尔", "彼得兔全集：小兔子本杰明", "彼得兔全集：大胡子塞缪尔", "疯狂动物城 奇思妙想 涂色书", "遇见春天", "彼得兔全集：两只淘气鼠", "有些时候，我特别喜欢爸爸", "有些时候，我特别喜欢妈妈", "彼得兔全集：小不点太太", "夏日的一天", "最爱的，是我", "彼得兔全集：格罗斯特的老裁缝", "我是霸王龙", "小猪咪普喳普呀普去海边", "彼得兔全集：小猪罗宾逊", "蚯蚓的日记", "公鸡的新邻居", "爱心树", "彼得兔全集：田园鼠和城市鼠", "吃饭不挑食", "小熊维尼1", "中国经典童谣", "狮子王", "小熊维尼-拼音美绘本", "睡前故事", "勇气", "下雪天", "我只拿了一块", "汉声中国童话：春：二月的故事", "汉声中国童话：春：三月的故事", "勇敢的小花猪", "汉声中国童话故事新版精装全套3册上789月秋中国传统民间神话故事节日绘本儿童书籍非注音版正版0", "汉声中国童话：秋：九月的故事", "汉声中国童话：秋：七月的故事", "宝宝学说话", "汉声中国童话·五月的故事", "汉声中国童话：夏：四月的故事", "汉声中国童话·六月的故事", "宝宝学说话趣味字词", "汉声中国童话：冬：十一月的故事", "汉声中国童话故事新版精装全套3册上10", "宝宝学说话语音游戏", "汉声中国童话全套12册中国童话故事精选一到十二月春夏秋冬绘本中国传统民间神话故事节日绘本0", "贝贝熊系列电视迷", "上学", "贝贝熊系列学校的烦恼", "贝贝熊系列钱的学问", "搬家", "在奶奶家", "恶作剧", "对待陌生人", "受人冷落", "贝贝熊系列朋友之交", "贝贝熊系列朋友之交", "贝贝熊系列难忘的生日", "傻大胆儿", "南瓜比赛", "见啥要啥", "小宝贝智力·谜语大全", "小宝贝智力·彩泥大全", "小眼睛大世界-识动物", "简笔画初学大全", "斯凯瑞最受欢迎的故事", "会讲故事的单词书", "不许抠鼻子！", "我的床下有鬼吗?", "好饿的毛毛虫", "是谁嗯嗯在我的头上", "我床上的老虎", "大卫，不可以", "我不要亲亲", "你睡不着吗?", "穿狼外套的羊", "中国成语故事", "伊索寓言", "我不会走丢", "老鼠娶新娘", "种子、沙子和小水滴", "要是你给小老鼠吃饼干", "爷爷一定有办法", "穿靴子的猫", "落叶跳舞", "蚯蚓的日记", "河流中的动物趣闻", "耍杂技的小山羊", "模仿老鹰的乌鸦", "吃胡萝卜的狼", "被嘲笑的老鸭子", "森林里的小老鼠一家", "飞上天的小兔", "这就是我们的历史—长城", "兵马俑", "寺庙，塔", "四大发明", "天安门，故宫", "圆明园，颐和园",
  "丝绸之路，大运河", "瓷器，青铜器", "田鼠阿佛", "海马先生", "蒲蒲兰绘本馆 彩虹色的花", "最爱的，是我", "你真好", "遇到你，真好", "你看起来好像很好吃", "我爱你", "永远永远爱你", "三只山羊嘎啦嘎啦", "牙齿大街的新鲜事", "德国精选科学图画书:肚子里有个火车站", "了不起的动物", "大雨哗啦哗啦下", "森林大熊", "SkippyjonJones", "CLASS ACTION", "DOG HOUSE", "小阿力的大学校", "野兽国", "广州假日行", "古韵南京", "七彩昆明", "悠闲成都", "草莓有哪些朋友呀", "友谊的种子", "小房子", "小房子", "走进纸王国", "变幻的四季", "神秘的太阳系", "汤姆去海滩", "爱讲故事的小鱼儿", "小年，祭灶节", "重阳节", "腊八节", "除夕春节", "七夕，乞巧节", "清明节", "元宵节", "中秋节", "端午节", "春龙，龙抬头", "恐龙小百科", "大雪", "聆听二十四节气：夏长欢歌", "聆听二十四节气：秋收乐曲", "聆听二十四节气：春种细语", "冬藏箴言", "神奇的校车·在人体中游览", "我要大蜥蜴", "讨厌黑夜的席奶奶", "风筝", "阿利的红斗篷", "都是蛀牙惹的祸", "乘法的秘密", "小小存钱罐", "万能的乘法", "苗苗成长记", "忙碌的运动会", "怪物喜欢热", "智慧故事", "故事会2018-8下", "故事会2019-1下", "故事会2019-2上", "故事会2018%8", "故事会2017-6上", "故事会2018%10上", "故事会2019-4下", "佐贺的超级阿嬷", "阿西兔的美味汤", "下雨的书店", "野风车", "蜗牛骑士", "小王子", "小王子-中英文完全对照-图文珍藏版", "唐诗三百首", "你是那人间四月天", "13天云南悠游记", "十万个为什么", "十万个为什么（校园版）-生活大爆炸", "汉字是画出来的", "诸子寓言故事", "植物小百科", "恐龙小百科", "国旗小百科", "星期三的战争", "一年级的小豆豆", "一年级大个子二年级小个子", "尼尔斯骑鹅旅行记-彩绘注音版", "伊索寓言", "数学真美妙 小学3~4年级", "小学生必背古诗词75+80首", "小学生笔画部首结构字级笔顺字典-大字本", "预言未来的帽子", "史前生物之谜", "末陀罗那海魔星之谜", "查理九世 18", "查理九世11", "查理九世15", "查理九世 5", "查理九世4：法老王之心", "查理九世22·所罗门王的魔戒", "查理九世20", "查理九世 失落的海底城12", "查理九世19", "查理九世：黑贝街的亡灵", "查理九世13：鬼公主的嫁衣", "柯南 威斯巴尼亚的传说", "查理九世3", "查理九世羽蛇神的黄金眼9", "查理九世10", "凤还巢", "四郎探母", "玉堂春", "北京女篮", "秦香莲", "白蛇传", "兵器知识4c", "兵器知识8c", "兵器知识6c", "兵器知识10c", "兵器知识2c", "兵器知识3c", "兵器知识9c", "兵器知识11c", "兵器知识12c", "兵器知识5c", "兵器知识7c", "探测地球内部的窗口", "海洋游历记", "科学教师教学用书：六年级 下册", "生物学 七年级上册", "生物学7年级下册", "生物学 八年级上册", "生物学8年级下册", "科学五年级下册", "科学三年级下册", "科学：三年级下册", "科学：五年级下册", "科学：四年级下册", "科学活动手册四年级下册", "科学活动手册五年级下册", "科学活动手册六年级下册", "我身上的为什么", "我身边的为什么", "饮食中的为什么", "家中的为什么", "家门外的为什么", "地球上的为什么", "动物和植物的为什么", "天空中的为什么", "我的第1套百科全书（自然卷）", 
  "思泉语文课本-点亮大语文 三年级下册", "思泉语文课本-点亮大语文 三年级上册", "心理健康教育教学参考：小学", "让宝宝越玩越聪明的益智游戏大全-0-3岁", "你好，书画！", "你好，圣人！", "你好，美食！", "你好，成语！", "你好，神话！", "你好，戏曲！", "你好，服饰！", "你好，汉字！", "你好，节日！", "你好，丝绸之路！", "你好，四大发明！", "你好，中医！", "你好，二十四节气！", "你好，史书！", "你好，文学！", "你好，蒙童！", "你好，礼仪！", "你好，名姓！", "你好，皇帝！", "你好，大师！", "字的童话", "字的童话 3：怪博士的神奇照相机", "字的童话 5：十二声笑", "字的童话 ：福尔摩斯新探索", "字的童话2 ：信精灵", "字的童话7 ：小巫婆的心情夹心糖", "字的童话1 ：英雄小野狼", "字的童话 4：巴巴国王变变变机", "激发无限潜能的300个科学实验游戏", "失落的一角", "名牌小学入学准备：英语", "海洋动物图鉴", "野生动物图鉴", "小猪唏哩呼噜：注音版下", "小猪唏哩呼噜上", "走近人的身体", "小学生好词·好句·好段-彩色图文版", "小学生看图说话写话-彩色图文版", "绘本窗边的小豆豆1", "辽 西夏 金 元", "明", "少年读历史—清", "宋", "隋 唐 五代", "两晋 南北朝", "三国", "秦 汉", "传说时代 夏 商 西周", "春秋战国", "青铜葵花", "单行街", "根鸟", "草房子", "马戏团", "细米", "山羊不吃天堂草", "天黑了", "红瓦黑瓦(修订本)", "时间都去哪儿了-我们还没好好感受年轻就老了", "呼兰河传", "逻辑思维 只要五步", "暗店街", "自控力", "男人女人残疾人", "三生三世十里桃花", "香气", "村上春树·猫", "启功的书画世界", "我这辈子有过你", "我讲个故事，你可别当真啊", "只要活着就会有好事发生", "别相信任何人", "生于午夜", "俗世奇人", "把灵魂卖给猫-徐德亮的猫小说", "夜半撞车", "真心离伤心最近", "男神很忙", "乔布斯传-神一样的男人", "心灵鸡汤", "受益一生的北大管理课", "人虫儿", "生活中不可不知的经济学常识", "梦想这条路踏上了，跪着也要把它走完-马云的人生信念", "高效能人士的11个习惯", "马云的说话之道-关键时刻，马云说了什么，又是如何说的？", "催眠大师", "会说话 会办事 会做人", "只有警察知道", "哈佛气质课", "散德行", "仓央嘉措诗传", "你可以更彪悍地应对世界", "无终仙境", "李嘉诚价值千万的财富课", "开国元勋英模颂", "玩火", "善行天下", "善行天下", "习近平讲故事", "道德经", "中国1946", "戊卫一生-我们的红色警卫生涯", "亲爱的安德烈", "一切皆有可能-奥巴马给年轻人的62个忠告", "遇见你，才是最好的时光-让所有人心动的爱情", "巴国侯氏", "祼地", "决策内幕", "沉浮人生", "名人春秋", "高层寒暑", "历史真相", "霜降", "红高粱家族", "天才在左 疯子在右", "把最好的自己留给对的人", "朗读者", "只懂ABC的妈妈培养出了英语天才", "培养孩子的英文耳朵", "喂故事书长大的孩子", "钢铁是怎样炼成的-权威全译典藏版", "静静的顿河一", "静静的顿河二", "静静的顿河三", "静静的顿河：4", "假如给我三天光明-权威全译典藏版", "闺蜜境遇", "和你在一起，我很高兴", "你了解全世界，却不了解我", "潜意识的力量", "秒速5厘米", "一粒红尘", "男人天生被她们吸引", "南昌起义亲历记-贺龙警卫连长随军见闻纪实",
   "流浪的面包树", "去你家玩好吗", "那些为你无眠的夜晚", "你是最好的自己", "人生中最美妙的事都是免费的", "红颜露水", "哈佛情商课大全集", "哈佛思维训练课", "中国茶道全书", "人一生要读的经典", "国学知识全知道", "家庭医学全书", "别让不懂营养学害了你", "过敏性鼻炎200个怎么办", "颈椎病132个怎么办", "肥胖症多学科综合治疗218个怎么办", "健康大百科：中青年篇", "健康大百科：孕育篇", "健康大百科：心理健康篇", "健康大百科：学龄前儿童篇", "健康大百科：老年篇", "健康大百科：青少年篇", "健康大百科：口腔保健篇", "健康大百科：心脑血管病防治篇", "健康大百科：传染病防治篇", "健康大百科：家庭急救篇", "张奉春教你痛风就该这样吃", "肾好才是硬道理", "北大心理课", "写给大家看的口才书", "健康五谷养生粥", "茶经·续茶经-插图版", "养生茶饮大全", "糖尿病饮食+运动+中医调养200招", "养肝病自除", "养脾胃病自除", "养心病自除", "养肾病自除", "养肺病自除", "中医中老年养生保健", "男人补肾 女人养肝", "血糖这样降最有效", "三高这样降最有效", "血压这样降最有效", "脊柱健康人无病-百病源头话脊柱", "心理健康 一年级上册", "心理健康 一年级下册", "心理健康 二年级上册", "心理健康 二年级下册", "心理健康三年级上册", "心理健康 三年级下册", "心理健康 四年级上册", "心理健康 四年级下册", "心理健康 五年级上册", "心理健康 五年级下册", "心理健康 六年级上册", "心理健康 六年级下册", "你好，青春期（我与互联网）", "你好，青春期～我要上初中了", "你好，青春期～学会管理情绪", "你好，青春期～完美女孩", "你好，青春期～友情与幸福", "你好，青春期～青春期的秘密", "你好，青春期～完美男孩", "你好，青春期～我爱时尚", "你好，青春期～我的家庭", "宅在故宫边-九方宅建造手记", "老子的智慧-精装典藏新善本",];
 
let zuozhe = ["莱尔.卢埃林,迈克.戈登　", "莱尔.卢埃林,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　",
 "莱尔.卢埃林　,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　",
 "莱尔.卢埃林　,迈克.戈登　", "莱尔.卢埃林　,迈克.戈登　", "阿斯特丽德·戴斯博尔德 ,波利娜·马丁", "凯伦·海瑟 ,G.布莱恩·卡拉斯", "", "[日] 宫西达也 文/图", "土田义晴", "", "帕特里克·麦克唐奈文·图", "山姆·麦克布雷尼 /文 安妮塔·婕朗/图", "斯泰茜·麦克安尔蒂", "宫西达也", "阿斯特丽德·戴斯博尔德 ,波利娜·马丁", "后藤龙二文", "美国迪士尼公司童趣出版有限公司", "罗伦斯·安荷特文", "简·卡特勒文",
 "皮姆·范·赫斯特,妮可·塔斯马", "", "瑞贝卡·帕特森", "孙悦 文 张鹏", "韩小霞", "金静华文", "许萍萍", "周谅选", "许萍萍", "许萍萍", "周谅选", "许萍萍", "许萍萍", "恐龙小Q儿童教育中心", "恐龙小Q儿童教育中心", "恐龙小Q儿童教育中心", "恐龙小Q儿童教育中心", "恐龙小Q儿童教育中心", "恐龙小Q儿童教育中心", "蒂皮.德格雷", "弗恩雷.布克斯", "飞扬花鼓", "", "袋鼠妈妈童书", "美国迪士尼公司童趣出版有限公司",
 "李欧·李奥尼文·图", "袋鼠妈妈童书", "兆丰, 赵乐, 方清", "美国迪士尼公司", "迪士尼公司童趣出版有限公司", "迪士尼童趣出版有限公司", "", "", "", "", "", "", "", "", "", "阿兰德·丹姆", "", "", "莫里斯·普莱格尔 编", "莫里斯·普莱格尔文·图", "", "莫丽斯·普莱格尔", "阿兰德·丹姆", "莫里斯·普莱格尔 编", "阿兰德·丹姆", "", "", "若真", "", "若真", "若真",
 "若真", "", "斯坦·博丹简·博丹", "玛格丽特·怀兹·布朗文", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "葆拉·福克斯", "克利斯提昂·约里波瓦文", "克利斯提昂·约里波瓦", "克利斯提昂·约里波瓦文", "", "", "", "", "", "", "聪聪图书", "聪聪图书", "聪聪图书", "聪聪图书", "聪聪图书", "聪聪图书", "聪聪图书", "聪聪图书", "聪聪图书",
 "聪聪图书", "聪聪图书", "聪聪图书", "聪聪图书", "聪聪图书", "聪聪图书", "聪聪图书", "聪聪图书", "聪聪图书", "聪聪图书", "", "", "", "", "", "", "", "", "", "《天黑了，睡觉觉》编写组", "本书编写组", "《去买玩具啦》编写组", "《我喜欢刷牙》写组", "本书编写组", "《我来帮忙》编写组", "《起床了，穿衣服》编写组", "本书编写组", "《大家一起玩》编写组", "比阿特丽克斯·波特廖志军",
 "比阿特丽克斯·波特廖志军", "比阿特丽克斯·波特廖志军", "比阿特丽克斯·波特廖志军", "比阿特丽克斯·波特廖志军", "", "秦好史郎,原京子", "比阿特丽克斯·波特廖志军", "阿诺·阿梅哈文", "阿诺·阿梅哈", "比阿特丽克斯·波特廖志军", "秦好史郎", "宫西达也", "比阿特丽克斯·波特廖志军", "", "筒井赖子 ,秦好史郎", "比阿特丽克斯·波特廖志军", "朵琳·克罗宁", "（日）岸良真由子 文/（日）高畠纯/彭懿 译", "谢尔·希尔弗斯坦",
 "比阿特丽克斯·波特廖志军", "本书编写组", "", "", "", "米尔恩|改编:彭晓勃", "", "［美］伯纳德·韦伯", "艾兹拉·杰克·季兹", "恐龙小Q儿童教育中心", "汉声杂志社", "汉声杂志社", "恐龙小Q儿童教育中心", "汉声杂志社", "汉声杂志社", "汉声杂志社", "", "汉声杂志社 编写·绘图", "汉声杂志社", "汉声杂志社 编写·绘图", "", "汉声杂志社", "", "", "汉声杂志社", "", "斯坦·博丹简·博丹",
 "", "", "斯坦·博丹简·博丹", "斯坦·博丹简·博丹", "斯坦·博丹简·博丹", "斯坦·博丹,简·博丹", "斯坦·博丹,简·博丹", "", "", "", "斯坦·博丹,简·博丹", "斯坦·博丹,简·博丹", "斯坦·博丹,简·博丹", "", "", "吴小丫", "七色花少儿益智开发中心", "理查德·斯凯瑞", "理查德·斯凯瑞", "（英）托尼· 罗斯", "(比)G.V.西纳顿", "", "维尔纳·霍尔茨瓦特文", "G. V. 西纳顿", "",
 "曼努埃拉·莫纳里文", "马丁·韦德尔文", "喜多村惠", "萨丽·森泽尔·艾萨克斯", "图说天下珍藏版", "达柯玛尔·盖斯勒", "张玲玲文", "两色风景", "劳拉·努梅罗夫 ,费利希亚·邦德", "菲比·吉尔曼文·图", "弗雷德·马塞利诺插图", "", "希亚文·奥拉姆文", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "李欧·李奥尼文·图", "艾瑞·卡尔", "", "", "",
 "", "", "", "", "P.C. 阿斯别约恩森，J.E. 姆厄整理", "", "鲁斯曼?安娜(插图作者)，舒尔茨?史蒂芬(插图作者)", "乔舒亚·道格拉斯", "大卫·香农", "约克·史坦纳", "", "", "", "罗伦斯·安荷特文", "莫里斯·桑达克", "秦晶", "韩小霞", "刘凌紫", "刘之南", "", "迈克尔·福尔曼", "维吉尼亚·李·伯顿", "维吉尼亚·李·伯顿", "", "孙静", "孙静", "克莱特·海林文",
  "朱莉娅·唐纳森文,阿克塞尔-舍夫勒", "", "", "", "", "", "", "", "", "", "", "", "燕子", "蕾玲", "蕾玲", "蕾玲", "", "乔安娜·柯尔文", "凯伦·考芙曼·欧洛夫文", "凯利·杜兰·瑞安", "鲁迅 文,大钧", "汤米·狄波拉", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "岛田洋七", "张秋生", "日向理惠子 ,吉田尚令", "曹文轩", "",
 "圣埃克絮佩里", "圣·德克旭贝里", "崔钟雷", "", "阿乐", "韩启德", "韩启德", "小象汉字", "曲波", "", "", "", "加里·施密特", "狐狸姐姐", "古田足日", "塞尔玛·拉格洛芙", "伊索", "刘勇", "张瑞征", "万森", "黄朝", "黄朝", "黄朝", "雷欧幻像", "雷欧幻像", "雷欧幻像", "雷欧幻像", "雷欧幻像", "雷欧幻像", "雷欧幻像", "雷欧幻像", "雷欧幻像", "雷欧幻像", "雷欧幻像",
 "雷欧幻像", "雷欧幻像", "雷欧幻像", "雷欧幻像", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "台湾牛顿出版公司", "", "人民教育出版社, 课程教材研究所, 生物课程教材研究开发中心", "", "人民教育出版社, 课程教材研究所, 生物课程教材研究开发中心", "", "", "", "", "", "", "", "", "", "", "", "", "",
 "", "", "", "", "迪士尼公司", "窦昕", "窦昕", "俞国良", "高润", "蒙曼", "蒙曼", "蒙曼", "蒙曼", "蒙曼", "蒙曼", "蒙曼", "蒙曼", "蒙曼", "蒙曼", "蒙曼", "蒙曼", "蒙曼", "蒙曼", "蒙曼", "蒙曼", "蒙曼", "蒙曼", "蒙曼", "蒙曼", "", "林世仁哲也", "林世仁哲也", "林世仁哲也", "林世仁哲也", "林世仁哲也", "林世仁哲也", "林世仁哲也", "薛莎莎",
 "谢尔·希尔弗斯坦", "周勇", "赵云, 李东哲", "宋斯伟, 李东哲", "孙幼军", "孙幼军", "段伟", "廉东星总", "廉东星总", "（日）黑柳彻子 著 （日）岩崎千弘", "", "", "赵云田", "", "", "", "", "", "", "", "曹文轩", "曹文轩", "曹文轩", "曹文轩", "曹文轩", "曹文轩", "曹文轩", "曹文轩", "曹文轩", "轩雨幽冉", "萧红", "下地宽也", "帕特里克·莫迪亚诺", "",
 "", "唐七公子", "王斌", "铃村和成", "启功", "张小娴", "囧叔", "", "[英]S.J.沃森", "", "冯骥才", "徐德亮", "", "", "", "明道", "", "", "", "", "邢群麟", "杨晖", "张笑恒", "", "", "", "", "狗子", "马辉, 苗欣宇", "云峰", "天下霸唱", "", "", "高占祥", "", "", "人民日报评论部", "", "", "刘辉山, 古远兴著述", "龙应台,安德烈",
 "陈添富", "古保祥", "小桥老树", "葛水平", "《作家文摘》", "《作家文摘》", "", "", "", "严歌苓", "莫言", "高铭", "", "本哈德·施林克", "", "汪培珽", "汪培珽", "尼·奥斯特洛夫斯基", "", "", "", "米·肖洛霍夫", "海伦·凯勒", "", "渡渡", "仇小丫", "约瑟夫·墨菲", "新海诚", "独木舟", "苏芩", "黄霖", "张小娴", "韩寒", "张小娴", "杨杨,张皓宸", "尼尔·帕斯理查",
 "张小娴", "尚波", "", "", "", "梦远", "张清", "雷·D·斯全德", "施锐", "叶启彬", "于健春, 于康, 朱惠娟", "方来英", "方来英", "杨甫德", "申昆玲", "陈峥", "王天有", "孙正", "马长生", "金荣华", "朱华栋", "张奉春", "朱惠东", "星汉", "李国辉", "", "陆羽, 陆廷灿", "孙志慧", "刘超", "杨悦娅", "", "卓鹏伟", "毕丽娟", "周晴", "罗卓洲", "彭玉清",
 "陈飞松, 曹军", "孙树侠, 于雅婷", "温玉波, 陈飞松", "张芗", "俞国良", "俞国良", "俞国良", "俞国良", "", "俞国良", "俞国良", "俞国良", "俞国良", "俞国良", "俞国良", "俞国良", "法（玛蒂尔德•吉拉德）", "", "", "", "", "", "", "", "", "张清帆, 张波", "林语堂"];

 let leixing_book = ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "文学/美洲文学", "", "文学/亚洲文学/日本文学", "文学/亚洲文学/日本文学", "文学/美洲文学", "文学/欧洲文学", "文化、科学、教育、体育", "文学/亚洲文学/日本文学", "", "文学/亚洲文学/日本文学", "",
 "文学/欧洲文学", "文学/美洲文学", "文学/欧洲文学", "", "文学/欧洲文学", "", "文学/中国文学/儿童文学/当代作品（1949年－）", "文学/中国文学/儿童文学/当代作品（1949年－）/图画故事", "文学/中国文学/儿童文学/当代作品（1949年－）", "文学/中国文学/诗歌、韵文/古代作品", "文学/中国文学/儿童文学/当代作品（1949年－）", "数理科学和化学/数学（一）", "文学/中国文学/诗歌、韵文/古代作品", "天文学、地球科学/天文学/时间、历法",
 "文学/中国文学/儿童文学/当代作品（1949年－）", "文学/中国文学/儿童文学/当代作品（1949年－）", "文学/中国文学/儿童文学/当代作品（1949年－）", "文学/中国文学/儿童文学/当代作品（1949年－）", "文学/中国文学/儿童文学/当代作品（1949年－）", "文学/中国文学/儿童文学/当代作品（1949年－）", "文学/中国文学/儿童文学/当代作品（1949年－）", "", "", "文学/亚洲文学", "", "生物科学/普通生物学", "",
 "文学/美洲文学", "医药、卫生/基础医学/人体生理学/神经生理", "文化、科学、教育、体育", "", "", "", "", "", "", "", "", "", "", "", "", "文学/欧洲文学", "", "", "", "语言、文字/常用外国语/英语/英语语文教学/英语读物", "", "", "文学/欧洲文学", "", "文学/欧洲文学", "", "", "艺术/绘画/中国绘画/各种用途画", "", "艺术/绘画/中国绘画/各种用途画", "艺术/绘画/中国绘画/各种用途画",
 "艺术/绘画/中国绘画/各种用途画", "", "", "文学/美洲文学", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "文学/美洲文学", "文学/欧洲文学", "文学/欧洲文学", "文学/欧洲文学", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "文学/欧洲文学",
 "", "文化、科学、教育、体育", "", "", "", "", "", "", "文化、科学、教育、体育", "文化、科学、教育、体育", "文化、科学、教育、体育", "文化、科学、教育、体育", "文化、科学、教育、体育", "文化、科学、教育、体育/职教、成教及其他教育", "文化、科学、教育、体育", "文化、科学、教育、体育", "文化、科学、教育、体育", "", "", "", "", "", "", "", "", "文学/欧洲文学", "文学/欧洲文学",
 "", "文学/亚洲文学/日本文学", "文学/亚洲文学/日本文学", "", "", "", "", "文学/美洲文学", "文学/亚洲文学/日本文学", "文学/美洲文学", "", "文化、科学、教育、体育", "", "", "", "文学/欧洲文学", "", "文学/美洲文学", "文学/美洲文学", "文学/中国文学/儿童文学/当代作品（1949年－）", "文学/中国文学/儿童文学/当代作品（1949年－）", "文学/中国文学/儿童文学/当代作品（1949年－）",
 "文学/中国文学/儿童文学/当代作品（1949年－）", "", "文学/中国文学/儿童文学/当代作品（1949年－）", "文学/中国文学/儿童文学/当代作品（1949年－）", "", "文学/中国文学/儿童文学/当代作品（1949年－）", "文学/中国文学/儿童文学/当代作品（1949年－）", "文学/中国文学/儿童文学/当代作品（1949年－）", "", "文学/中国文学/儿童文学/当代作品（1949年－）", "", "", "", "", "", "", "",
 "", "", "", "", "", "", "", "", "", "", "", "", "", "", "艺术/绘画/绘画技法", "文学/美洲文学", "文学/美洲文学", "文学/欧洲文学", "", "文学/美洲文学", "文学/欧洲文学/东欧、中欧文学/德国文学", "文学/欧洲文学", "文学/美洲文学", "文学/欧洲文学", "文学/欧洲文学", "文学/亚洲文学/日本文学", "", "", "文学/欧洲文学/东欧、中欧文学/德国文学", "文学/中国文学/儿童文学/当代作品（1949年－）/图画故事",
 "文学/中国文学/儿童文学/当代作品（1949年－）", "文学/美洲文学", "文学/美洲文学/加拿大文学", "文学/美洲文学", "文学/亚洲文学/日本文学", "文学/欧洲文学", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "文学/美洲文学", "文学/美洲文学", "文学/亚洲文学/日本文学", "", "", "", "", "", "", "文学/欧洲文学", "文学/欧洲文学/东欧、中欧文学/德国文学",
 "", "生物科学/动物学", "文学/美洲文学", "", "", "", "", "文学/欧洲文学", "文学/美洲文学", "文学/中国文学/儿童文学/当代作品（1949年－）", "文学/中国文学/儿童文学/当代作品（1949年－）", "文学/中国文学/儿童文学/当代作品（1949年－）", "文学/中国文学/儿童文学/当代作品（1949年－）", "", "文学/欧洲文学", "文学/美洲文学", "文学/美洲文学", "", "天文学、地球科学/天文学/时间、历法",
 "天文学、地球科学/天文学/太阳系", "文学/欧洲文学", "文学/欧洲文学", "", "", "", "", "", "", "", "", "", "", "", "文学/中国文学/儿童文学/当代作品（1949年－）", "天文学、地球科学/大气科学（气象学）/气候学", "天文学、地球科学/大气科学（气象学）/气候学", "天文学、地球科学/大气科学（气象学）/气候学", "", "医药、卫生/基础医学/人体形态学", "文学/美洲文学", "文学/美洲文学", "文学/中国文学/儿童文学/当代作品（1949年－）",
 "文学/美洲文学", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "文学/亚洲文学/日本文学", "文学/中国文学/儿童文学/当代作品（1949年－）", "", "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说", "", "文学/欧洲文学", "语言、文字/常用外国语/英语/英语语文教学/英语读物", "文学/中国文学/诗歌、韵文/古代作品", "", "历史、地理/地理/中国地理/专类地理/旅行、游记",
 "综合性图书/百科全书、类书/中国百科全书、类书/综合性普及读物/青年读物", "", "", "", "生物科学/植物学", "生物科学/古生物学", "", "", "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说/长篇、中篇小说", "", "语言、文字/汉语/文字学", "", "文化、科学、教育、体育", "文化、科学、教育、体育", "文化、科学、教育、体育", "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说", "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说",
 "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说", "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说/长篇、中篇小说", "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说/长篇、中篇小说", "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说/长篇、中篇小说", "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说/长篇、中篇小说", "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说/长篇、中篇小说",
 "", "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说/长篇、中篇小说", "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说/长篇、中篇小说", "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说/长篇、中篇小说", "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说", "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说/长篇、中篇小说", "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说/长篇、中篇小说",
 "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说/长篇、中篇小说", "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说/长篇、中篇小说", "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说/长篇、中篇小说", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "天文学、地球科学/地球物理学/大地（岩石界）物理学（固体地球物理学）", "天文学、地球科学/海洋学",
 "文化、科学、教育、体育", "文化、科学、教育、体育", "", "文化、科学、教育、体育", "", "", "", "文化、科学、教育、体育", "文化、科学、教育、体育", "文化、科学、教育、体育", "", "", "", "", "", "", "", "", "", "", "", "", "文化、科学、教育、体育", "文化、科学、教育、体育", "文化、科学、教育、体育/教育/教育心理学", "文化、科学、教育、体育", "艺术/绘画/绘画技法/中国画画技法",
 "", "工业技术/轻工业、手工业/制品工业/生活服务技术/美食学", "", "", "", "历史、地理/风俗习惯", "语言、文字/汉语/文字学", "历史、地理/风俗习惯", "历史、地理/地理/中国地理/专类地理", "自然科学总论/自然科学理论与方法论/自然科学史", "医药、卫生/中医", "天文学、地球科学/大气科学（气象学）/气候学", "历史、地理/中国历史/通史/古代史籍", "", "语言、文字/汉语/汉语教学/汉语读物", "", "", "", "",
 "", "文学/中国文学/儿童文学/当代作品（1949年－）", "文学/中国文学/儿童文学/当代作品（1949年－）", "文学/中国文学/儿童文学/当代作品（1949年－）", "文学/中国文学/儿童文学/当代作品（1949年－）", "文学/中国文学/儿童文学/当代作品（1949年－）", "文学/中国文学/儿童文学/当代作品（1949年－）", "文学/中国文学/儿童文学/当代作品（1949年－）", "自然科学总论/自然科学研究方法", "文学/美洲文学", "文化、科学、教育、体育",
 "生物科学/动物学", "生物科学/动物学", "文学/中国文学/儿童文学/当代作品（1949年－）/童话、寓言", "语言、文字/汉语/文字学", "医药、卫生/基础医学/人体形态学", "文化、科学、教育、体育", "文化、科学、教育、体育", "文学/亚洲文学/日本文学", "", "", "", "", "", "", "", "", "", "", "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说/长篇、中篇小说", "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说",
 "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说/长篇、中篇小说", "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说/长篇、中篇小说", "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说/短篇小说、微型小说", "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说/长篇、中篇小说", "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说/长篇、中篇小说", "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说",
 "文学/中国文学/儿童文学/当代作品（1949年－）/儿童小说/长篇、中篇小说", "哲学、宗教/心理学", "文学/中国文学/小说/现代作品（1919年－1949年）/新体长篇、中篇小说", "哲学、宗教/思维科学（总论）", "文学/欧洲文学", "", "", "", "文学/中国文学/小说/当代作品（1949年－）/新体长、中篇小说", "文学/亚洲文学/日本文学", "艺术/绘画/书法篆刻/中国书法、篆刻", "文学/中国文学/小说/当代作品（1949年－）/新体长、中篇小说",
 "文学/中国文学/散文/当代作品（1949年－）", "", "", "", "文学/中国文学/小说/当代作品（1949年－）", "文学/中国文学/小说/当代作品（1949年－）", "", "", "", "历史、地理/外国人物传记/美洲人物传记", "", "", "", "", "经济", "哲学、宗教/心理学", "语言、文字/语言学/语音学/朗诵法、演讲术", "", "", "", "", "文学/中国文学/散文", "文学/中国文学/民间文学/古代至现代作品（－1949年）",
 "哲学、宗教/伦理学", "文学/中国文学/小说/当代作品（1949年－）/新体长、中篇小说", "", "", "文学/中国文学/小说/当代作品（1949年－）/新体长、中篇小说", "", "", "政治、法律/中国共产党", "", "", "政治、法律/中国政治/国家行政管理/公安工作", "", "哲学、宗教/心理学", "社会科学总论/社会学", "文学/中国文学/小说/当代作品（1949年－）/新体长、中篇小说", "文学/中国文学/小说/当代作品（1949年－）/新体长、中篇小说",
 "历史、地理/中国历史/中华人民共和国：社会主义革命和社会主义建设时期（1949年－）", "历史、地理/中国人物传记", "", "", "", "文学/中国文学/小说/当代作品（1949年－）/新体长、中篇小说", "文学/中国文学/小说/当代作品（1949年－）/新体长、中篇小说", "文学/中国文学/报告文学/通讯、特写", "", "文学/欧洲文学/东欧、中欧文学/德国文学/小说", "", "语言、文字/常用外国语/英语/英语语文教学", "文化、科学、教育、体育/职教、成教及其他教育/家庭教育",
 "文学/欧洲文学/东欧、中欧文学", "", "", "", "文学/欧洲文学/东欧、中欧文学/前苏联文学", "历史、地理/外国人物传记/美洲人物传记", "", "文学/中国文学/散文/当代作品（1949年－）", "文学/中国文学/散文/当代作品（1949年－）", "哲学、宗教/心理学", "文学/亚洲文学/日本文学 /小说", "文学/中国文学/小说/当代作品（1949年－）/新体长、中篇小说", "哲学、宗教/伦理学", "历史、地理/中国历史/新民主主义革命时期（1919年－1949年）/第二次国内革命战争（土地革命战争）时期（1927年－1937年）",
 "文学/中国文学/小说/当代作品（1949年－）/新体长、中篇小说", "文学/中国文学/作品集", "文学/中国文学/散文", "艺术/摄影艺术/中国摄影艺术", "文学/美洲文学/加拿大文学", "文学/中国文学/小说/当代作品（1949年－）/新体长、中篇小说", "哲学、宗教/心理学", "", "", "", "综合性图书/丛书/中国丛书", "医药、卫生/临床医学/康复医学", "医药、卫生/预防医学、卫生学/营养卫生、食品卫生", "医药、卫生/耳鼻咽喉科学", "医药、卫生/外科学/骨科学",
 "医药、卫生/内科学/内分泌腺疾病及代谢病", "医药、卫生/预防医学、卫生学/个人卫生/一般保健法", "医药、卫生/妇产科学", "医药、卫生/基础医学", "医药、卫生/预防医学、卫生学/妇幼、儿童、少年卫生", "医药、卫生/预防医学、卫生学/个人卫生/一般保健法", "医药、卫生", "医药、卫生/口腔科学", "医药、卫生/内科学", "医药、卫生/预防医学、卫生学/流行病学与防疫", "医药、卫生/临床医学/治疗学", "医药、卫生/中医/中医内科", "医药、卫生/中医/中医内科",
 "哲学、宗教", "语言、文字/语言学/语音学/朗诵法、演讲术", "", "工业技术/轻工业、手工业/制品工业/生活服务技术/美食学", "医药、卫生/中医/中医临床学/其他疗法", "", "医药、卫生/中医/中医内科", "", "医药、卫生/中医/中医内科", "医药、卫生/中医/中医内科", "医药、卫生/中医/中医内科", "医药、卫生/预防医学、卫生学/个人卫生/一般保健法", "医药、卫生/中医/中医内科", "医药、卫生/内科学/内分泌腺疾病及代谢病", "医药、卫生/内科学/内分泌腺疾病及代谢病",
 "医药、卫生/内科学/心脏、血管（循环系）疾病", "医药、卫生/外科学/骨科学", "文化、科学、教育、体育/教育/教育心理学", "文化、科学、教育、体育/教育/教育心理学", "文化、科学、教育、体育/教育/教育心理学", "文化、科学、教育、体育/教育/教育心理学", "", "文化、科学、教育、体育/教育/教育心理学", "文化、科学、教育、体育/教育/教育心理学", "文化、科学、教育、体育/教育/教育心理学", "文化、科学、教育、体育/教育/教育心理学", "文化、科学、教育、体育/教育/教育心理学",
 "文化、科学、教育、体育/教育/教育心理学", "文化、科学、教育、体育/教育/教育心理学", "", "", "", "", "", "", "", "", "", "工业技术/建筑科学/建筑设计/民用建筑", "哲学、宗教/中国哲学/先秦哲学（～公元前221年）/道家/老子（李耳）",];

 let len = name.length;

 let new_name = [];
 let new_leixing = [];
 let new_zuozhe = [];

 let index_book = [];
 let search_books = 0;

let zhuanhuan_arr = [];

let beiing_1 = {
    background: 'linear-gradient(to right, rgb(34, 193, 195), rgb(253, 187, 45))', 
}

 //将index——arr赋值
    for (let m = 0; m < len; m++) {
        index_book.push(convertToRoman(m));
    }
//删除空格，将字符串截取到合适的长度并截取
   for (let x = 0; x < name.length; x++) {
        name[x] = name[x].replace(/[　| ]/g, "");
        new_name[x] = name[x];
        if (name[x].length>8) {
            name[x] = name[x].substring(0, 8)+"..";
        }        
    }

    for (let c = 0; c < zuozhe.length; c++) {
        zuozhe[c] = zuozhe[c].replace(/[　| ]/g, "");
        new_zuozhe[c] = zuozhe[c];
        if (zuozhe[c].length > 6) {
            zuozhe[c] = zuozhe[c].substring(0, 6)+"..";
        }
        if (zuozhe[c].length=="") {
            zuozhe[c] = "作者未知";
        }
    }

    for (let l = 0; l < leixing_book.length; l++) {
        new_leixing[l] = leixing_book[l];
        if (leixing_book[l].length>9) {
            leixing_book[l] = leixing_book[l].substring(0, 6)+"..";
        }
        if (leixing_book[l].length=="") {
            leixing_book[l] = "绘本";
        }
    }

    function SortAgain () {
        if (zhuanhuan_arr !=  "") {
        zhuanhuan(name,zhuanhuan_arr);
        zhuanhuan(zuozhe,zhuanhuan_arr);
        zhuanhuan(leixing_book,zhuanhuan_arr);
        zhuanhuan(index_book,zhuanhuan_arr);
        }
    }

    function search_book(num){
        return new_name[num];
    }

//智能模糊搜索引擎
    function vague_search (input_1){
        if (input_1) {
            SortAgain();
            let arr = [];
            let arr_2 = [];
            let str = "";

            for (let l = 0; l < new_name.length; l++) {
                if (new_name[l]==input_1 || new_zuozhe[l] == input_1 || new_name[l].indexOf(input_1) != -1 || new_zuozhe[l].indexOf(input_1) != -1) {
                    arr.push(convertToRoman(l));
                    arr_2.push(l);
                    str+=search_book(l)+"--";
                }
            }
            
            zhuanhuan_arr = arr_2;
            search_books = arr.length;
            zhuanhuan(name,arr_2);
            zhuanhuan(zuozhe,arr_2);
            zhuanhuan(leixing_book,arr_2);
            zhuanhuan(index_book,arr_2);
            let id = arr.join("--");
            if (str == "") {
                id = "NULL";
                str = "NULL";
            }
                return(
                    <div>
                        <div className="qianlie">
                            &emsp;算法将与搜索条件相关的书籍优先至前列
                        </div>
                        <div className="xiangguan">
                            与搜索条件有关的ID为： &emsp;：{id}
                        </div>
                        <br/>
                        <div className="xiangguan">
                            与搜索条件有关的书籍有： &emsp;：{str}
                        </div>
                    </div>
                );
            }
        return (
            <div>
                无相关书籍，可以在下面书库找找你想看的书，或者去往崇西绘本馆search!
            </div>
        );
    }
//转古罗马数字
    function convertToRoman(num) {
        let luoma = [
            ["I", "II", "III", "IV", "V", "VI", "VII", "VIII", "IX"],
            ["X", "XX", "XXX", "XL", "L", "LX", "LXX", "LXXX", "XC"],
            ["C", "CC", "CCC", "CD", "D", "DC", "DCC", "DCCC", "CM"],
            ["M", "MM", "MMM", "MMMM", "MMMMM", "MMMMMM", "MMMMMMM", "MMMMMMMM", "MMMMMMMMM"]
        ];
        if (num == 0) {
            return "O"
        }
        num += "";
        num = num.split('');
        let c = 0;
        for (let n = num.length - 1; n >= 0; n--) {
            let d = num[n];
            d = parseInt(d, 10);
            num[n] = luoma[c][d - 1];
            c++;
        }
        return num.join('');
    }

//将与search条件有关的书优先显示（数组内元素相互转换）
//arr数组是将要转换的数组，arr_2数组是要转换内容的下标
function zhuanhuan(arr,arr_2){
    for (let n = 0; n < arr_2.length; n++) {
        let str = arr[n];
        arr[n] = arr[arr_2[n]];
        arr[arr_2[n]] = str;
    }
}
    
//最终返回函数
   export default class Book extends Component{
    constructor(props) {
        super(props);
        this.state = {value: ""};
        this.handleChange = this.handleChange.bind(this);
    };
    
    handleChange(event) {
      this.setState({value: event.target.value});
    };

    render(){
        var value = this.state.value;

        return(
            <div className="all_book">
                <div className="beijingshu">
                    <div className="Book_1">
                        <img src="Img/logo.svg" alt="" />
                    </div>
                </div>
                <div className="sousuo">
                    <div>
                        本馆共藏图书{len}本，（本网站不定时更新）
                    </div>
                    <div>
                        <div>
                            智能模糊搜索：输入你想看的书籍，作者,记得不多也可以试着search一下哦！
                            <br />
                            <br />
                        </div>
                        <div className="sousuokuang" >
                            <img src="Img/search.svg" alt="" /> 
                            <input placeholder="Search Book | author" className="input_search" type="text" value={value} onChange={this.handleChange} /> 
                        </div>
                        <div>
                            <br />
                            <br />
                            {vague_search(value)}
                        </div>
                    </div>
                </div>
                <div className="shuji_big">
                    <div className="shuji">
                        {name.map((mingzi,index) => {
                            if (index<search_books) {
                                return (
                                    <Book_one key={index} color={beiing_1} color_2={{backgroundColor:"darkmagenta"}}  name={name[index]} img_link={"Img/shubaonan.svg"} renqun={index_book[index]} leixing={leixing_book[index]} zuozhe={zuozhe[index]} />
                                )
                            }else{
                                return (
                                    <Book_one key={index} name={name[index]} img_link={"Img/shubaonv.svg"} renqun={index_book[index]} leixing={leixing_book[index]} zuozhe={zuozhe[index]} />
                                )
                            }
                        })}
                    </div>
                </div>
                
            </div>
        )

    }
    
}